tangyangguang/Esp32_Fan_4P/src/web/FanWeb.cpp
    // Sleep Wait
    snprintf(buf, sizeof(buf), "%d", _controller->getSleepWaitTime());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(CONFIG_SLEEP_END);

    // Soft Start
    snprintf(buf, sizeof(buf), "%d", _controller->getSoftStartTime());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(CONFIG_START_END);

    // Soft Stop
    snprintf(buf, sizeof(buf), "%d", _controller->getSoftStopTime());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(CONFIG_STOP_END);

    // Block Detect
    snprintf(buf, sizeof(buf), "%d", _controller->getBlockDetectTime());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(CONFIG_BLOCK_END);

    // LED Flash
    snprintf(buf, sizeof(buf), "%d", _controller->getLedFlashDuration());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(CONFIG_LED_FLASH_END);

    // Runtime Save
    snprintf(buf, sizeof(buf), "%u", _controller->getRuntimeSaveIntervalMinutes());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(CONFIG_RUNTIME_SAVE_END);

    // Auto Restore
    Esp32BaseWeb::sendChunk(_controller->getAutoRestore() ? "selected" : "");
    Esp32BaseWeb::sendChunk(CONFIG_AUTO_END);
    Esp32BaseWeb::sendChunk(_controller->getAutoRestore() ? "" : "selected");
    Esp32BaseWeb::sendChunk(CONFIG_AUTO_END2);

    for (uint8_t i = 0; i < IR_KEY_COUNT; i++) {
        uint8_t protocol = 0;
        uint64_t code = 0;
        _ir->getKeyCode(i, &protocol, &code);
        bool duplicate = false;
        if (protocol != 0 || code != 0) {
            for (uint8_t j = 0; j < IR_KEY_COUNT; j++) {
                if (j == i) continue;
                uint8_t other_protocol = 0;
                uint64_t other_code = 0;
                _ir->getKeyCode(j, &other_protocol, &other_code);
                if (protocol == other_protocol && code == other_code) {
                    duplicate = true;
                    break;
                }
            }
        }
        char value[56];
        if (protocol != 0 || code != 0) {
            snprintf(value, sizeof(value), "%s%u - 0x%016llX",
                     duplicate ? "Duplicate: protocol " : "Protocol ",
                     protocol, (unsigned long long)code);
        } else {
            strcpy(value, "Not learned");
        }
        char row[320];
        snprintf(row, sizeof(row),
            "<div class=irrow id=irr%u><div><b>%s</b><span id=irv%u%s>%s</span></div>"
            "<button onclick='learn(%u,\"%s\")'>Learn</button>"
            "<button class=secondary onclick='clearIr(%u,\"%s\")'>Clear</button></div>",
            i, irKeyName(i), i, duplicate ? " class=warn" : "", value,
            i, irKeyName(i), i, irKeyName(i));
        Esp32BaseWeb::sendChunk(row);
    }
    Esp32BaseWeb::sendChunk(CONFIG_IR_END);

    Esp32BaseWeb::sendFooter();
}

// API Handlers

void FanWeb::handleApiStatus() {
    if (!Esp32BaseWeb::checkAuth()) return;

    char buf[2048];
    char clock[24];
    const char* stateStr;
    switch (_controller->getState()) {
        case SYS_IDLE: stateStr = "Idle"; break;
        case SYS_RUNNING: stateStr = "Running"; break;
        case SYS_SLEEP: stateStr = "Sleep"; break;
        case SYS_ERROR: stateStr = "Error"; break;
        case SYS_RECOVERING: stateStr = "Recovering"; break;
        default: stateStr = "Unknown"; break;
    }

    char ip[24];
    if (Esp32BaseWiFi::isConnected()) {
        Esp32BaseWiFi::ip(ip, sizeof(ip));
    } else {
        strcpy(ip, "N/A");
    }
    long rssi = Esp32BaseWiFi::isConnected() ? (long)Esp32BaseWiFi::rssi() : 0;
    if (Esp32BaseNtp::isTimeSynced()) {
        Esp32BaseNtp::formatTime(clock, sizeof(clock), "%Y-%m-%d %H:%M:%S");
    } else {
        strcpy(clock, "N/A");
    }

    uint8_t ir_key = _ir->getLearnedKeyIndex();
    snprintf(buf, sizeof(buf),
        "{\"ok\":true,\"data\":{\"state\":\"%s\",\"speed\":%d,\"target_speed\":%d,\"gear\":%u,\"rpm\":%u,\"timer_remaining\":%lu,"
        "\"run_duration\":%lu,\"boot_run_duration\":%lu,\"blocked\":%s,\"min_speed\":%u,\"soft_start\":%u,\"soft_stop\":%u,"
        "\"block_detect\":%u,\"sleep_wait\":%u,\"auto_restore\":%s,\"led_flash_ms\":%u,"
        "\"ip\":\"%s\",\"rssi\":%ld,\"clock\":\"%s\","
        "\"ir_learning\":%s,\"ir_key\":%u,\"ir_remaining\":%lu,\"ir_learn_seq\":%lu,"
        "\"ir_reject_seq\":%lu,\"ir_duplicate_key\":%u,"
        "\"ir_last_protocol\":%u,\"ir_last_code\":\"0x%016llX\"}}",
        stateStr, _controller->getCurrentSpeed(), _controller->getTargetSpeed(),
        _controller->getCurrentGear(),
        _controller->getCurrentRpm(),
        (unsigned long)_controller->getTimerRemaining(),
        (unsigned long)_controller->getTotalRunDuration(),
        (unsigned long)_controller->getBootRunDuration(),
        _controller->isBlocked() ? "true" : "false",
        _controller->getMinEffectiveSpeed(),
        _controller->getSoftStartTime(),
        _controller->getSoftStopTime(),
        _controller->getBlockDetectTime(),
        _controller->getSleepWaitTime(),
        _controller->getAutoRestore() ? "true" : "false",
        _controller->getLedFlashDuration(),
        ip, rssi, clock,
        _ir->isLearning() ? "true" : "false", ir_key,
        (unsigned long)_ir->getLearningRemaining(),
        (unsigned long)_ir->getLearnedSequence(),
        (unsigned long)_ir->getLearnRejectSequence(),
        _ir->getDuplicateKeyIndex(),
        _ir->getLastProtocol(),
        (unsigned long long)_ir->getLastCode()
    );
    Esp32BaseWeb::sendJson(200, buf);
}

void FanWeb::handleApiSpeed() {
    if (!Esp32BaseWeb::checkAuth()) return;

    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        uint32_t speed = 0;
        if (parseUintParam("speed", 0, 100, &speed)) {
            ESP32BASE_LOG_I("FanWeb", "user_action speed=%lu", static_cast<unsigned long>(speed));
            if (!_controller->setSpeed(static_cast<uint8_t>(speed))) {
                ESP32BASE_LOG_W("FanWeb", "speed_request_failed speed=%lu", static_cast<unsigned long>(speed));
                Esp32BaseWeb::sendJson(409, "{\"ok\":false,\"error\":\"speed rejected\"}");
                return;
            }
            char buf[64];
            snprintf(buf, sizeof(buf), "{\"ok\":true,\"speed\":%d,\"target_speed\":%d}",
                     _controller->getCurrentSpeed(), _controller->getTargetSpeed());
            Esp32BaseWeb::sendJson(200, buf);
            return;
        }
        ESP32BASE_LOG_W("FanWeb", "invalid_speed_request");
        Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid request\"}");
    } else {
        char buf[64];
        snprintf(buf, sizeof(buf), "{\"ok\":true,\"speed\":%d,\"target_speed\":%d}",
                 _controller->getCurrentSpeed(), _controller->getTargetSpeed());
        Esp32BaseWeb::sendJson(200, buf);
    }
}

void FanWeb::handleApiTimer() {
    if (!Esp32BaseWeb::checkAuth()) return;

    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        uint32_t seconds = 0;
        if (parseUintParam("seconds", 0, 356400, &seconds)) {
            ESP32BASE_LOG_I("FanWeb", "user_action timer_seconds=%lu", static_cast<unsigned long>(seconds));
            if (!_controller->setTimer(seconds)) {
                ESP32BASE_LOG_W("FanWeb", "timer_request_failed seconds=%lu", static_cast<unsigned long>(seconds));
                Esp32BaseWeb::sendJson(500, "{\"ok\":false,\"error\":\"timer save failed\"}");
                return;
            }
            char buf[64];
            snprintf(buf, sizeof(buf), "{\"ok\":true,\"timer_remaining\":%lu}",
                     (unsigned long)_controller->getTimerRemaining());
            Esp32BaseWeb::sendJson(200, buf);
            return;
        }
        ESP32BASE_LOG_W("FanWeb", "invalid_timer_request");
        Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid request\"}");
    } else {
        char buf[64];
        snprintf(buf, sizeof(buf), "{\"ok\":true,\"timer_remaining\":%lu}", (unsigned long)_controller->getTimerRemaining());
        Esp32BaseWeb::sendJson(200, buf);
    }
}

