tangyangguang/Esp32_Fan_4P/src/web/FanWeb.cpp
void FanWeb::handleApiStop() {
    if (!Esp32BaseWeb::checkAuth()) return;
    ESP32BASE_LOG_I("FanWeb", "user_action stop_fan");
    if (!_controller->stop()) {
        ESP32BASE_LOG_W("FanWeb", "stop_request_failed");
        Esp32BaseWeb::sendJson(500, "{\"ok\":false,\"error\":\"stop save failed\"}");
        return;
    }
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

void FanWeb::handleApiConfig() {
    if (!Esp32BaseWeb::checkAuth()) return;

    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        ESP32BASE_LOG_I("FanWeb", "user_action save_config");
        uint8_t changed = 0;
        uint8_t min_speed = _controller->getMinEffectiveSpeed();
        uint16_t soft_start = _controller->getSoftStartTime();
        uint16_t soft_stop = _controller->getSoftStopTime();
        uint16_t block_detect = _controller->getBlockDetectTime();
        uint16_t sleep_wait = _controller->getSleepWaitTime();
        uint16_t led_flash_ms = _controller->getLedFlashDuration();
        uint8_t runtime_save_min = _controller->getRuntimeSaveIntervalMinutes();
        bool auto_restore = _controller->getAutoRestore();

        if (Esp32BaseWeb::hasParam("min_speed")) {
            uint32_t parsed = 0;
            if (!parseUintParam("min_speed", 0, 50, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid min_speed\"}");
                return;
            }
            min_speed = static_cast<uint8_t>(parsed);
        }
        if (Esp32BaseWeb::hasParam("soft_start")) {
            uint32_t parsed = 0;
            if (!parseUintParam("soft_start", 0, 10000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid soft_start\"}");
                return;
            }
            soft_start = static_cast<uint16_t>(parsed);
        }
        if (Esp32BaseWeb::hasParam("soft_stop")) {
            uint32_t parsed = 0;
            if (!parseUintParam("soft_stop", 0, 10000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid soft_stop\"}");
                return;
            }
            soft_stop = static_cast<uint16_t>(parsed);
        }
        if (Esp32BaseWeb::hasParam("block_detect")) {
            uint32_t parsed = 0;
            if (!parseUintParam("block_detect", 100, 5000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid block_detect\"}");
                return;
            }
            block_detect = static_cast<uint16_t>(parsed);
        }
        if (Esp32BaseWeb::hasParam("sleep_wait")) {
            uint32_t parsed = 0;
            if (!parseUintParam("sleep_wait", 1, 3600, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid sleep_wait\"}");
                return;
            }
            sleep_wait = static_cast<uint16_t>(parsed);
        }
        if (Esp32BaseWeb::hasParam("led_flash_ms")) {
            uint32_t parsed = 0;
            if (!parseUintParam("led_flash_ms", 0, 2000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid led_flash_ms\"}");
                return;
            }
            led_flash_ms = static_cast<uint16_t>(parsed);
        }
        if (Esp32BaseWeb::hasParam("runtime_save_min")) {
            uint32_t parsed = 0;
            if (!parseUintParam("runtime_save_min", 1, 60, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid runtime_save_min\"}");
                return;
            }
            runtime_save_min = static_cast<uint8_t>(parsed);
        }
        if (Esp32BaseWeb::hasParam("auto_restore")) {
            uint32_t parsed = 0;
            if (!parseUintParam("auto_restore", 0, 1, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid auto_restore\"}");
                return;
            }
            auto_restore = parsed != 0;
        }

        bool ok = _controller->applyConfig(min_speed, soft_start, soft_stop, block_detect,
                                           sleep_wait, led_flash_ms, runtime_save_min,
                                           auto_restore, &changed);
        if (ok && changed > 0) {
            _controller->notifyUserAction();
        }
        ESP32BASE_LOG_I("FanWeb", "config_save_complete changed=%u ok=%u",
                          (unsigned)changed, ok ? 1U : 0U);
        char buf[320];
        snprintf(buf, sizeof(buf),
            "{\"ok\":%s,\"changed\":%u,\"data\":{\"min_effective_speed\":%d,\"soft_start\":%d,\"soft_stop\":%d,"
            "\"block_detect\":%d,\"sleep_wait\":%d,\"led_flash_ms\":%d,\"runtime_save_min\":%u,\"auto_restore\":%s}}",
            ok ? "true" : "false",
            (unsigned)changed,
            _controller->getMinEffectiveSpeed(),
            _controller->getSoftStartTime(),
            _controller->getSoftStopTime(),
            _controller->getBlockDetectTime(),
            _controller->getSleepWaitTime(),
            _controller->getLedFlashDuration(),
            _controller->getRuntimeSaveIntervalMinutes(),
            _controller->getAutoRestore() ? "true" : "false"
        );
        Esp32BaseWeb::sendJson(ok ? 200 : 500, buf);
    } else {
        char buf[320];
        snprintf(buf, sizeof(buf),
            "{\"ok\":true,\"data\":{\"min_effective_speed\":%d,\"soft_start\":%d,\"soft_stop\":%d,"
            "\"block_detect\":%d,\"sleep_wait\":%d,\"led_flash_ms\":%d,\"runtime_save_min\":%u,\"auto_restore\":%s}}",
            _controller->getMinEffectiveSpeed(),
            _controller->getSoftStartTime(),
            _controller->getSoftStopTime(),
            _controller->getBlockDetectTime(),
            _controller->getSleepWaitTime(),
            _controller->getLedFlashDuration(),
            _controller->getRuntimeSaveIntervalMinutes(),
            _controller->getAutoRestore() ? "true" : "false"
        );
        Esp32BaseWeb::sendJson(200, buf);
    }
}

