tangyangguang/Esp32_Fan_4P/src/web/FanWeb.cpp
void FanWeb::handleApiIrLearn() {
    if (!Esp32BaseWeb::checkAuth()) return;

    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST) && Esp32BaseWeb::hasParam("key_index")) {
        uint32_t idx = 0;
        if (parseUintParam("key_index", 0, IR_KEY_COUNT - 1, &idx)) {
            if (Esp32BaseWeb::hasParam("clear")) {
                IRCodeChangeResult result = _controller->clearIRCode(static_cast<uint8_t>(idx));
                bool changed = result == IR_CODE_CHANGED;
                if (changed) _controller->notifyUserAction();
                ESP32BASE_LOG_I("FanWeb", "user_action ir_clear key=%lu changed=%u",
                                  static_cast<unsigned long>(idx), changed ? 1U : 0U);
                if (result == IR_CODE_SAVE_FAILED) {
                    Esp32BaseWeb::sendJson(500, "{\"ok\":false,\"error\":\"ir save failed\"}");
                    return;
                }
                char buf[64];
                snprintf(buf, sizeof(buf), "{\"ok\":true,\"changed\":%s}", changed ? "true" : "false");
                Esp32BaseWeb::sendJson(200, buf);
                return;
            }
            if (_ir->startLearning(static_cast<uint8_t>(idx))) {
                ESP32BASE_LOG_I("FanWeb", "user_action ir_learn key=%lu", static_cast<unsigned long>(idx));
                char buf[128];
                snprintf(buf, sizeof(buf), "{\"ok\":true,\"learning\":true,\"timeout\":10,\"seq\":%lu,\"rej_seq\":%lu}",
                         (unsigned long)_ir->getLearnedSequence(),
                         (unsigned long)_ir->getLearnRejectSequence());
                Esp32BaseWeb::sendJson(200, buf);
                return;
            }
        }
    }
    ESP32BASE_LOG_W("FanWeb", "invalid_ir_learn_request");
    Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid request\"}");
}
